package com.tansun.algorithm;

public class BasicOperation {

    /*
     * 7二进制 0000 0000 0000 0000 0000 0000 0000 0111
     *        1111 1111 1111 1111 1111 1111 1111 1000  取反之后变成负数了
     *        1000 0000 0000 0000 0000 0000 0000 0111 补码
     *        1000 0000 0000 0000 0000 0000 0000 1000 原码  == -8
     *
     * 取反运算特殊作用：使一个数的最低位为零，可以表示为：a&~1
     * “~”运算符的优先级比算术运算符、关系运算符、逻辑运算符和其他运算符都高。
     * */

    public static void main(String[] args) {
        // 取反运算
        System.out.println(~7);
    }
}
